
# Efinity Interface Designer SDC
# Version: 2022.1.226
# Date: 2023-01-07 09:04

# Copyright (C) 2017 - 2022 Efinix Inc. All rights reserved.

# Device: T20Q144
# Project: PS32-lite
# Timing Model: C3 (final)

# PLL Constraints
#################
create_clock -period 5.1020 AMIPLL_CLKOUT0
create_clock -period 71.4286 MC_CLK_CLEAN
create_clock -period 71.4286 MC_CLK


set_false_path -from AMIPLL_CLKOUT0 -to MC_CLK_CLEAN
set_false_path -from AMIPLL_CLKOUT0 -to MC_CLK

set_false_path -from MC_CLK_CLEAN -to AMIPLL_CLKOUT0
set_false_path -from MC_CLK_CLEAN -to MC_CLK

set_false_path -from MC_CLK -to AMIPLL_CLKOUT0
set_false_path -from MC_CLK -to MC_CLK_CLEAN

# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {KBRESET}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {KBRESET}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_BERR_n}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_BERR_n}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_BG_n}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_BG_n}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_CLK}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_CLK}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_DSACK_n[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_DSACK_n[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_DSACK_n[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_DSACK_n[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_IPL_n[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_IPL_n[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_IPL_n[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_IPL_n[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_IPL_n[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_IPL_n[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_A[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_A[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_A[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_A[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_A[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_A[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_RD}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_RD}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_SER_CLK}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_SER_CLK}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_SER_DAT}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_SER_DAT}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_WR}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_WR}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ADDR_LE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ADDR_LE}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {ADDR_OE_n}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {ADDR_OE_n}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {CTRL_OE_n}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {CTRL_OE_n}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DATA_OE_n}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DATA_OE_n}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_IPL[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_IPL[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_IPL[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_IPL[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_IPL[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_IPL[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_KBRESET}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_KBRESET}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_TXN_IN_PROGRESS}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_TXN_IN_PROGRESS}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[18]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[18]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[18]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[18]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[18]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[18]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[19]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[19]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[19]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[19]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[19]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[19]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[24]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[24]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[24]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[24]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[24]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[24]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[25]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[25]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[25]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[25]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[25]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[25]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[28]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[28]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[28]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[28]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[28]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[28]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[29]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[29]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[29]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[29]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[29]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[29]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {INT2_n_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {INT2_n_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {INT2_n_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {INT2_n_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {INT2_n_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {INT2_n_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {INT6_n_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {INT6_n_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {INT6_n_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {INT6_n_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {INT6_n_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {INT6_n_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_AS_n_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_AS_n_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_AS_n_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_AS_n_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_AS_n_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_AS_n_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_BR_n_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_BR_n_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_BR_n_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_BR_n_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_BR_n_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_BR_n_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_DS_n_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_DS_n_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_DS_n_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_DS_n_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_DS_n_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_DS_n_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_FC_IN[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_FC_IN[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_FC_OUT[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_FC_OUT[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_FC_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_FC_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_FC_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_FC_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_FC_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_FC_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_FC_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_FC_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_FC_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_FC_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_FC_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_FC_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_FC_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_FC_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_HALT_n_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_HALT_n_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_HALT_n_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_HALT_n_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_HALT_n_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_HALT_n_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_RESET_n_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_RESET_n_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_RESET_n_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_RESET_n_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_RESET_n_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_RESET_n_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_RW_IN}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_RW_IN}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_RW_OUT}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_RW_OUT}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_RW_OE}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_RW_OE}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_SIZE_IN[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_SIZE_IN[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_SIZE_OUT[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_SIZE_OUT[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_SIZE_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_SIZE_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_SIZE_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_SIZE_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_SIZE_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_SIZE_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {MC_SIZE_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {MC_SIZE_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[8]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[9]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[9]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[10]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[10]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[11]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[11]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[12]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[12]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[13]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[13]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[14]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[14]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_IN[15]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_IN[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OUT[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OUT[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {PI_D_OE[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {PI_D_OE[15]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_IN[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_IN[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OUT[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OUT[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_IN[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_IN[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OUT[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OUT[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_IN[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_IN[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OUT[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OUT[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OE[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_IN[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_IN[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OUT[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OUT[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_IN[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_IN[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OUT[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OUT[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_IN[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_IN[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OUT[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OUT[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {SPARE_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {SPARE_OE[7]}]

# LVDS RX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[4]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[4]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[5]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[5]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[5]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[6]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[6]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[7]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[7]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[8]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[8]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[8]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[8]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[9]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[9]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[9]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[9]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[14]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[14]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[14]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[14]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[15]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[15]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[15]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[15]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[16]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[16]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[16]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[16]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[17]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[17]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[17]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[17]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[26]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[26]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[26]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[26]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[26]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[26]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[27]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[27]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[27]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[27]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[27]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[27]}]

# LVDS Rx Constraints
####################

# LVDS TX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[3]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[10]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[10]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[10]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[10]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[11]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[11]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[11]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[11]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[12]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[12]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[12]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[12]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[13]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[13]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[13]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[13]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[20]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[20]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[20]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[20]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[20]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[20]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[21]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[21]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[21]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[21]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[21]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[21]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[22]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[22]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[22]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[22]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[22]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[22]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[23]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[23]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[23]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[23]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[23]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[23]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[30]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[30]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[30]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[30]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[30]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[30]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_IN[31]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_IN[31]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OUT[31]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OUT[31]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {DA_OE[31]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {DA_OE[31]}]

# LVDS Tx Constraints
####################
